import pyproj
from pyproj import Proj
#Координаты Администрации верхний левый угол в WGS84 (32.044304, 54.780470)
# Проекция поперечный меркатор и элипсоид WGS84
#"--- МСК-67 Смоленская область ---"
#"МСК-67 зона 1", 8, 1001, 7, 32.48333333333, 0, 1, 1250000, -5612900.56
#"МСК-67 зона 2", 8, 1001, 7, 35.48333333333, 0, 1, 2250000, -5612900.56
#"МСК-67 зона 3", 8, 1001, 7, 38.48333333333, 0, 1, 3250000, -5612900.56
#
#"--- МСК-67 Смоленская область ГОСТ 51794-2008 ---"
#"МСК-67 зона 1", 8, 9999, 3, 23.57, -140.95, -79.8, 0, -0.35, -0.79, -0.22, 0, 7, 32.48333333333, 0, 1, 1250000, -5612900.56
#"МСК-67 зона 2", 8, 9999, 3, 23.57, -140.95, -79.8, 0, -0.35, -0.79, -0.22, 0, 7, 35.48333333333, 0, 1, 2250000, -5612900.56
#"МСК-67 зона 3", 8, 9999, 3, 23.57, -140.95, -79.8, 0, -0.35, -0.79, -0.22, 0, 7, 38.48333333333, 0, 1, 3250000, -5612900.56

#x = 32.044304
#y = 54.780470

x = 31.83842
y = 55.510840

print(pyproj.__version__)
#merc - меркатор EPSG:54004 ESRI: World Mercator 
# - EPSG:3857 WGS 84 / Pseudo-Mercator
projection1 = pyproj.Proj(proj='longlat', ellps='WGS84', datum='WGS84')
#projection2 = pyproj.Proj(proj='merc', ellps='WGS84', datum='WGS84')

projection2 = Proj('+proj=tmerc +lat_0=0 +lon_0=32.48333333333 +k=1 +x_0=1250000 +y_0=-5612900.56 +ellps=krass +towgs84=23.57, -138.65, -79.8, 0, 0.34, 0.79, 0.22, +units=m +no_defs')

long,lat = pyproj.transform(projection1, projection2, x, y)
print(long,lat)



